[
  {
    "id": "rest-api-design",
    "issues": [
      "XSS protection is primarily a frontend concern; for a REST API, input sanitization should focus on SQL injection and NoSQL injection rather than XSS.",
      "The AC for PATCH/PUT should specify the difference in idempotency and partial vs full updates for technical rigor."
    ],
    "educational_score": 9
  },
  {
    "id": "blog-platform",
    "issues": [
      "Logical gap: User Authentication is Milestone 2, but Project Setup (Milestone 1) defines the User table. For a stateful system, the session store configuration is missing from Milestone 1.",
      "Technical conflict: AC suggests storing raw Markdown but rendering to HTML in the CRUD layer; modern architectural standards recommend rendering at the edge or client-side to keep the API payload lightweight."
    ],
    "educational_score": 8
  },
  {
    "id": "chat-app",
    "issues": [
      "Critical security gap: Authentication should be Milestone 1. Establishing a WebSocket connection before authentication (Milestone 4) exposes the server to easy DOS attacks and resource exhaustion.",
      "Redundant AC: Typing indicators are listed as requirements in both Milestone 2 and Milestone 4."
    ],
    "educational_score": 7
  },
  {
    "id": "ecommerce-basic",
    "issues": [
      "Logical gap: Milestone 4 (Checkout) lacks a Payment Integration step (Mock or Third-party), which is essential for the 'atomic transaction' mentioned in the essence.",
      "Missing critical step: No AC for Order History/Persistence retrieval, which is necessary for a complete stateful journey."
    ],
    "educational_score": 7
  },
  {
    "id": "grpc-service",
    "issues": [],
    "educational_score": 10
  },
  {
    "id": "circuit-breaker",
    "issues": [
      "Conceptual error: The 'Bulkhead' pattern is listed as an AC for the Circuit Breaker. While related, they are distinct patterns; a bulkhead limits concurrency, while a circuit breaker manages failure state."
    ],
    "educational_score": 9
  },
  {
    "id": "file-upload-service",
    "issues": [
      "Logical gap: Missing a database/metadata layer to track file ownership, status (pending/complete), and the mapping between Upload IDs and storage paths.",
      "Technical inaccuracy: Scanning for viruses after storage (Milestone 3) is a security risk; scanning should occur in a memory buffer or a temporary 'quarantine' area before final persistence."
    ],
    "educational_score": 8
  },
  {
    "id": "websocket-server",
    "issues": [],
    "educational_score": 10
  },
  {
    "id": "notification-service",
    "issues": [
      "Logical gap: The essence mentions 'queue-based decoupling' and 'at-least-once delivery', but none of the milestones include the implementation of a message broker (e.g., Redis Pub/Sub, RabbitMQ) or retry backoff logic."
    ],
    "educational_score": 8
  },
  {
    "id": "graphql-server",
    "issues": [],
    "educational_score": 10
  },
  {
    "id": "background-job-processor",
    "issues": [
      "Logical Gap: To achieve 'Durable message persistence' and 'failure recovery' mentioned in the essence, using a simple Redis List with FIFO pop (LPOP/RPOP) is insufficient as data is lost if a worker crashes post-dequeue. The AC should specify the use of Redis Streams (XREADGROUP) or the RPOPLPUSH/LMOVE pattern to ensure atomicity.",
      "Technical Inaccuracy: The essence claims to maintain job ordering across distributed worker nodes while managing concurrency. In a distributed environment, strict FIFO ordering is typically sacrificed for performance unless a centralized sequencer or single-partition consumer logic is specified, which is absent from the AC."
    ],
    "educational_score": 8
  },
  {
    "id": "social-network",
    "issues": [],
    "educational_score": 10
  },
  {
    "id": "video-streaming",
    "issues": [
      "Logical Gap: The transition from Milestone 1 (Upload) to Milestone 2 (Transcoding) misses a 'File Assembly' or 'Persistence' step. For chunked multipart uploads, the AC must define how chunks are validated and reassembled before the FFmpeg pipeline can begin processing."
    ],
    "educational_score": 9
  },
  {
    "id": "api-gateway",
    "issues": [
      "Logical Gap: The essence explicitly mentions 'distributed rate limiting via token bucket algorithms,' but this is entirely missing from the milestones and acceptance criteria. This is a critical functional requirement for an API Gateway."
    ],
    "educational_score": 8
  },
  {
    "id": "distributed-tracing",
    "issues": [],
    "educational_score": 10
  },
  {
    "id": "collaborative-editor",
    "issues": [
      "Technical Inaccuracy: The milestones treat CRDTs (Milestone 1) and Operational Transformation (Milestone 3) as sequential steps in one project. These are distinct, often competing architectural choices for consistency. Implementing both in a single editor project is conceptually redundant and logically conflicting for a student."
    ],
    "educational_score": 7
  },
  {
    "id": "media-processing",
    "issues": [
      "Logical Gap: Milestone 3 (Processing Queue) should be the foundational Milestone 1. You cannot build a 'distributed job queue orchestration' with 'unreliable worker processes' if the processing logic (Milestones 1 & 2) is built in isolation first without the async execution context."
    ],
    "educational_score": 7
  },
  {
    "id": "multi-tenant-saas",
    "issues": [],
    "educational_score": 10
  },
  {
    "id": "build-react",
    "issues": [],
    "educational_score": 10
  },
  {
    "id": "build-bundler",
    "issues": [],
    "educational_score": 10
  },
  {
    "id": "http2-server",
    "issues": [
      "Missing 'Connection Preface' milestone: HTTP/2 requires a specific 24-byte client preface string ('PRI * HTTP/2.0...') before frame exchange.",
      "Missing 'Settings Exchange' milestone: Protocol mandates an initial SETTINGS frame handshake to negotiate concurrency and window sizes."
    ],
    "educational_score": 9
  },
  {
    "id": "container-basic",
    "issues": [
      "Gap in 'Mount Namespace': pivot_root typically requires the new root to be a mount point itself (using mount --bind) before the syscall succeeds.",
      "Missing 'User Namespaces': Crucial for security and 'rootless' containers, which is a standard educational step for modern isolation."
    ],
    "educational_score": 8
  },
  {
    "id": "mini-shell",
    "issues": [
      "Logical gap: Environment variable expansion ($VAR) and globbing (*.txt) are essential parsing steps missing from the command execution milestone.",
      "Inaccuracy: 'cd' and 'export' must be built-ins, but 'echo' is often an external utility as well; the distinction of why some must be built-ins is not highlighted."
    ],
    "educational_score": 9
  },
  {
    "id": "virtual-memory-sim",
    "issues": [
      "Gap in 'Page Replacement': The milestones do not address 'Disk I/O' or 'Swap Space' management, which is the actual trigger for page eviction logic.",
      "Technical detail: Multi-level page tables usually require a 'Page Directory' base register simulation to start the walk."
    ],
    "educational_score": 9
  },
  {
    "id": "filesystem",
    "issues": [
      "Major Logical Gap: 'Write-ahead journaling' is mentioned in the Essence but completely omitted from the Milestones and ACs.",
      "Inaccuracy: 'FUSE Interface' milestone should precede 'File Operations' if the testing strategy relies on the FUSE mount for verification."
    ],
    "educational_score": 7
  },
  {
    "id": "reverse-proxy",
    "issues": [
      "Missing Milestone: 'Header Manipulation'. Proxies must modify 'Host' headers and append 'X-Forwarded-For' to be functional in real environments.",
      "Gap: No mention of 'Buffering vs Streaming' for large request/response bodies."
    ],
    "educational_score": 9
  },
  {
    "id": "build-docker",
    "issues": [
      "Redundancy: Highly overlaps with 'container-basic'.",
      "Missing Milestone: 'Container Metadata'. Handling image entrypoints, ENV variables, and working directories is what separates Docker from a raw container."
    ],
    "educational_score": 8
  },
  {
    "id": "build-shell",
    "issues": [
      "Redundancy: Duplicates 'mini-shell' project with minor AC variations.",
      "Logical Gap: 'Signal Forwarding' in job control is complex and requires explaining 'tcsetpgrp' to transfer terminal control, which is not explicitly covered."
    ],
    "educational_score": 8
  },
  {
    "id": "build-allocator",
    "issues": [
      "Technical detail: 'Boundary tags' (footer) are mentioned in Essence but not required in AC; headers alone are insufficient for O(1) coalescing of the previous block.",
      "Educational Strength: Covers segregated lists and thread safety well."
    ],
    "educational_score": 10
  },
  {
    "id": "build-os",
    "issues": [
      "Logical Gap: The 'Global Descriptor Table (GDT)' setup should ideally be its own milestone before the Bootloader/Kernel entry is completed, as it's required for Protected Mode.",
      "Inaccuracy: 'Zeroing BSS' is usually a function of the linker script and CRT0, though acceptable as a manual kernel task."
    ],
    "educational_score": 10
  },
  {
    "id": "build-spreadsheet",
    "issues": [
      "Logical gap: Formula ranges (e.g., SUM(A1:A10)) must be expanded into individual cell dependencies before topological sorting, which is not mentioned in the dependency graph milestone.",
      "Technical gap: No AC for handling circular dependency resolution specifically in the context of the AST vs the graph."
    ],
    "educational_score": 8
  },
  {
    "id": "build-web-framework",
    "issues": [
      "Logical gap: Request/Response enhancement (like JSON parsing) should be defined as a middleware itself or occur before the middleware pipeline to ensure 'Logging' or 'Auth' middleware can access the body.",
      "Missing AC: Route matching logic for parameter extraction usually requires a Regex or Trie-based implementation, which is a major technical hurdle omitted."
    ],
    "educational_score": 9
  },
  {
    "id": "build-graphql-engine",
    "issues": [
      "Technical inaccuracy: The essence suggests both SQL JOINs and Batching (IN clause) for N+1. These are typically mutually exclusive strategies; implementing both in one project significantly overcomplicates the compiler logic.",
      "Logical gap: Missing a 'Validation' milestone for checking query depth or fragment cycles before execution."
    ],
    "educational_score": 7
  },
  {
    "id": "http-server-basic",
    "issues": [
      "Logical gap: The jump from sequential (M1) to thread-per-connection/async (M4) is huge; an intermediate milestone for state management of shared sockets would be beneficial.",
      "Missing AC: Milestone 3 (Static Files) lacks criteria for handling 'Range' requests or 'If-Modified-Since' headers common in basic servers."
    ],
    "educational_score": 9
  },
  {
    "id": "memory-pool",
    "issues": [
      "Technical inaccuracy: Fixed-size block allocators require 'Memory Alignment' logic (e.g., 8-byte or 16-byte boundaries) to prevent CPU traps on certain architectures, which is missing from the AC.",
      "Logical gap: Milestone 2 (Growing) doesn't specify how to handle the 'Free' operation when blocks span across different non-contiguous chunks."
    ],
    "educational_score": 8
  },
  {
    "id": "process-spawner",
    "issues": [
      "Logical gap: The 'Process Pool' milestone requires a mechanism (like a SIGCHLD handler or a manager thread) to detect worker death asynchronously, otherwise it will only respawn upon next work arrival.",
      "Technical gap: No mention of setting up process groups or sessions to manage child signals effectively."
    ],
    "educational_score": 8
  },
  {
    "id": "signal-handler",
    "issues": [
      "Critical educational gap: No mention of 'Async-Signal-Safety'. A common student mistake is calling non-safe functions like printf() inside a handler; this must be an AC.",
      "Missing AC: Handling 'EINTR' (interrupted system calls) in the main loop is mentioned as 'SA_RESTART', but manual handling is often necessary for portability."
    ],
    "educational_score": 9
  },
  {
    "id": "build-strace",
    "issues": [
      "Technical gap: Architecture specificity. Syscall numbers and register names (rax vs rdi) differ between x86_64 and ARM; the AC should specify a target architecture.",
      "Technical inaccuracy: PTRACE_PEEKDATA reads a single word; string decoding (like file paths) requires an iterative loop until a null terminator is found, which is non-trivial."
    ],
    "educational_score": 8
  },
  {
    "id": "build-event-loop",
    "issues": [
      "Logical gap: Does not distinguish between Level-Triggered and Edge-Triggered epoll; Edge-Triggered requires a loop to drain the socket, which is a key educational point for high-performance I/O.",
      "Missing AC: Milestone 4 requires write-readiness management; if a write fails with EAGAIN, the loop must register interest in EPOLLOUT, which is missing."
    ],
    "educational_score": 9
  },
  {
    "id": "build-kernel-module",
    "issues": [
      "Critical technical inaccuracy: Milestone 2 'cat/echo' requires the use of 'copy_to_user' and 'copy_from_user'. Directly accessing user-space pointers in the kernel will lead to security vulnerabilities or kernel panics.",
      "Logical gap: Milestone 4 mentions blocking reads but lacks AC for 'Non-blocking I/O' (O_NONBLOCK) handling."
    ],
    "educational_score": 8
  },
  {
    "id": "build-tcp-stack",
    "issues": [
      "Milestone 2 mentions IP checksums, but Milestone 3 omits TCP checksum calculation, which is technically more complex as it requires a pseudo-header including IP fields.",
      "No mention of handling IP fragmentation or Maximum Segment Size (MSS) negotiation, which are common points of failure in custom stacks."
    ],
    "educational_score": 9
  },
  {
    "id": "io-uring-server",
    "issues": [
      "Missing buffer management strategies; for high performance, 'Provided Buffers' (IORING_REGISTER_PBUF_RING) are essential to prevent out-of-buffer errors in async contexts.",
      "The 'Network Server' milestone lacks handling for 'short reads/writes' which are common in async I/O."
    ],
    "educational_score": 9
  },
  {
    "id": "btree-impl",
    "issues": [
      "The essence mentions 'minimize disk I/O', but the milestones focus entirely on in-memory pointer logic. There are no ACs for page serialization, file headers, or a Buffer Pool Manager.",
      "Missing AC for handling duplicate keys, which significantly changes split/delete logic."
    ],
    "educational_score": 8
  },
  {
    "id": "sql-parser",
    "issues": [
      "Significant gap: The milestones omit JOIN syntax (INNER, LEFT, CROSS), which is the most complex part of SQL parsing and AST generation.",
      "Lacks a 'Semantic Analysis' or 'Binding' step; a parser that doesn't validate column existence against a schema is of limited educational use for compilers."
    ],
    "educational_score": 7
  },
  {
    "id": "etl-pipeline",
    "issues": [
      "Logical gap: No mention of 'State/Checkpointing'. An ETL pipeline without the ability to resume from the last successful offset is not production-ready.",
      "The AC for 'Transformations' doesn't specify how schemas are handled between steps (e.g., Row-level vs. Vectorized)."
    ],
    "educational_score": 8
  },
  {
    "id": "cdc-system",
    "issues": [
      "Critical omission: 'Initial Snapshot'. CDC cannot start from a transaction log alone if the database already contains data; it requires a consistent point-in-time export.",
      "Exactly-once delivery is claimed in essence but the ACs only describe 'at-least-once' (resume from offset). Exactly-once requires idempotent consumers or 2-Phase Commit."
    ],
    "educational_score": 8
  },
  {
    "id": "data-quality-framework",
    "issues": [
      "Missing AC for 'Data Lineage' or 'Metadata tagging', which is usually how quality flags are propagated in real-world pipelines.",
      "No mention of 'Reference Data' validation (checking against a set of allowed values in another table)."
    ],
    "educational_score": 9
  },
  {
    "id": "message-queue",
    "issues": [
      "Logical conflict: Milestone 1 says 'delivered to all subscribers (fan-out)', while Milestone 2 says 'distribute round-robin'. These are mutually exclusive modes that need distinct configuration.",
      "The 'Backpressure' AC is vague; it doesn't specify if it's TCP-level backpressure or application-level (dropping messages vs. blocking producers)."
    ],
    "educational_score": 8
  },
  {
    "id": "query-optimizer",
    "issues": [
      "Logical gap: No mention of 'Predicate Pushdown' in the Plan Selection milestone, which is the most impactful optimization for reducing I/O.",
      "Statistics maintenance (Histogram/Sketching) is mentioned but how they are updated (ANALYZE command) is missing."
    ],
    "educational_score": 10
  },
  {
    "id": "wal-impl",
    "issues": [
      "Technical inaccuracy: The essence mentions ARIES-style recovery (Analysis, Redo, Undo), but the milestones don't mention the 'CLR' (Compensation Log Record) needed to prevent infinite loops during crashes during recovery.",
      "Missing the 'Steal/No-Force' buffer pool policy context; WAL is only necessary if the Buffer Pool is allowed to flush uncommitted pages."
    ],
    "educational_score": 9
  },
  {
    "id": "search-engine",
    "issues": [
      "Logical Gap: Missing document preprocessing milestone (Tokenization, Stemming, Stop-word removal), which is critical before building an inverted index.",
      "Technical Inaccuracy: BM25 requires global corpus statistics (Average Document Length), which should be explicitly part of the index or ranking milestone."
    ],
    "educational_score": 8
  },
  {
    "id": "event-sourcing",
    "issues": [
      "Logical Gap: Missing the 'Command' handling layer; the distinction between a Command (intent) and an Event (fact) is vital for business rule validation.",
      "Logical Gap: Missing 'Event Upcasting' for handling schema evolution in long-lived event streams."
    ],
    "educational_score": 9
  },
  {
    "id": "workflow-orchestrator",
    "issues": [
      "Logical Gap: Missing a 'State Store' milestone; a distributed orchestrator requires a persistent database to track task states across worker failures.",
      "Technical Inaccuracy: 'Topological sort' validates the graph but 'Execution' requires a state machine to handle concurrent branches."
    ],
    "educational_score": 9
  },
  {
    "id": "vector-database",
    "issues": [
      "Logical Gap: Missing Vector Quantization (Product Quantization/Scalar Quantization), which is standard for memory-efficient large-scale vector search.",
      "Technical Inaccuracy: Cosine similarity is typically implemented as 1 - Cosine Distance for indexing; the range -1 to 1 is correct but rarely used directly in distance-based graphs."
    ],
    "educational_score": 8
  },
  {
    "id": "build-redis",
    "issues": [
      "Logical Gap: Missing the core architectural milestone: the Single-Threaded Event Loop (using epoll/kqueue), which is the essence of Redis performance.",
      "Technical Inaccuracy: AOF and RDB coexistence is more complex; on startup, AOF is prioritized only if it is enabled, but the interaction during 'BGSAVE' needs careful concurrency handling."
    ],
    "educational_score": 10
  },
  {
    "id": "build-sqlite",
    "issues": [
      "Logical Gap: Missing the Virtual Machine (VDBE) milestone; SQLite's core is the compilation of SQL into bytecode, not direct execution of AST nodes.",
      "Technical Inaccuracy: SQLite uses B-trees for tables (clustered) and B+ trees for indexes; the essence should distinguish between 'Cell' structures for internal vs leaf nodes."
    ],
    "educational_score": 9
  },
  {
    "id": "build-kafka",
    "issues": [
      "Logical Gap: Missing a Metadata/Coordinator milestone (Zookeeper or KRaft clone) to manage broker discovery and leader election.",
      "Technical Inaccuracy: The 'High Watermark' is updated by the leader, not 'after all ISR members acknowledge'; it's the largest offset present in all ISR replicas."
    ],
    "educational_score": 8
  },
  {
    "id": "time-series-db",
    "issues": [
      "Logical Gap: Missing the 'Tag Index' (Inverted Index for metadata); without this, filtering by tags in a TSDB requires an inefficient full scan.",
      "Technical Inaccuracy: Delta-of-delta is used for timestamps, but XOR (Gorilla) compression is specific to floating point values, not all 'values' generally."
    ],
    "educational_score": 9
  },
  {
    "id": "stream-processing-engine",
    "issues": [
      "Logical Gap: Missing 'Backpressure' handling; a stream engine without flow control will crash when sources outpace sinks.",
      "Logical Gap: Missing 'SerDe' (Serialization/Deserialization) milestone for distributing data across the network between operators."
    ],
    "educational_score": 9
  },
  {
    "id": "capstone-database-engine",
    "issues": [
      "Logical Gap: Missing a 'Lock Manager' milestone; MVCC handles snapshots, but write-write conflicts and DDL changes require explicit locking logic.",
      "Technical Inaccuracy: Cost-based optimization usually requires 'Statistics Collection' (ANALYZE) as a prerequisite milestone to estimate cardinality accurately."
    ],
    "educational_score": 8
  },
  {
    "id": "service-discovery",
    "issues": [
      "Logical Gap: Missing 'Watch' or notification mechanism; relying solely on polling the API is inefficient for large-scale microservices.",
      "Logical Gap: Bootstrapping problem not addressed; clients need a way to find the Discovery Service itself (e.g., static IP, DNS, or Environment Variables).",
      "Technical Inaccuracy: TTL and Heartbeats are listed as separate mechanisms, but technically Heartbeats are the mechanism used to refresh the TTL to prevent expiration."
    ],
    "educational_score": 8
  },
  {
    "id": "rpc-basic",
    "issues": [
      "Technical Inaccuracy: TCP is a stream protocol; the AC fails to mention 'Message Framing' (length-prefixing or delimiters), which is required to prevent multiple JSON messages from merging in the buffer.",
      "Logical Gap: Missing Service Definition/IDL; there is no mention of how the client knows the method signatures without manual hardcoding.",
      "Logical Gap: Error handling lacks distinction between 'Network Errors' (transport) and 'Remote Exceptions' (application logic)."
    ],
    "educational_score": 7
  },
  {
    "id": "load-balancer-basic",
    "issues": [
      "Logical Gap: Connection Pooling is missing; opening a new TCP connection to the backend for every proxied request causes socket exhaustion.",
      "Technical Inaccuracy: 'IP Hash' for sticky sessions is unreliable behind NAT or Corporate Proxies where many users share one IP; Cookie-based affinity is the standard educational requirement here."
    ],
    "educational_score": 9
  },
  {
    "id": "rate-limiter",
    "issues": [
      "Logical Gap: Does not address 'Clock Drift' in the distributed section; if server times aren't synced, local-to-remote transitions can cause inconsistent windows.",
      "Logical Gap: Missing 'Burst' configuration in Milestone 1; Token Bucket specifically allows for bursts, but the AC doesn't define the burst size parameter."
    ],
    "educational_score": 9
  },
  {
    "id": "leader-election",
    "issues": [
      "Logical Gap: Does not address the 'Split Brain' scenario; the Bully and Ring algorithms are highly susceptible to network partitions without a Quorum (N/2 + 1) requirement.",
      "Technical Inaccuracy: In the Ring algorithm, the AC says the node with the highest ID becomes leader, but fails to mention the 'Election' vs 'Non-election' state transition to prevent infinite loops."
    ],
    "educational_score": 7
  },
  {
    "id": "replicated-log",
    "issues": [
      "Logical Gap: Missing the concept of 'Terms' or 'Epochs'; without them, a former leader rejoining the cluster could overwrite valid entries with stale data.",
      "Technical Inaccuracy: 'Read entries... O(1) lookup time' is only true for in-memory indices; disk-based logs require an index (offset map) to maintain this complexity."
    ],
    "educational_score": 8
  },
  {
    "id": "vector-clocks",
    "issues": [
      "Technical Inaccuracy: Pruning 'oldest versions' is dangerous in vector clocks as it can break causality detection; 'Dotted Version Vectors' or 'Summary Pruning' are the correct educational terms for safe garbage collection.",
      "Logical Gap: 'Last-writer-wins' is a conflict resolution strategy that effectively ignores the vector clock's purpose; 'Syntactic Merge' should be the primary focus."
    ],
    "educational_score": 8
  },
  {
    "id": "feature-flags",
    "issues": [
      "Logical Gap: No mention of 'Default Fallbacks' in the event the evaluation engine fails or the configuration file is corrupted.",
      "Logical Gap: Lacks 'Targeting Rules' hierarchy (e.g., User ID overrides Group ID)."
    ],
    "educational_score": 9
  },
  {
    "id": "job-scheduler",
    "issues": [
      "Logical Gap: Missing 'Misfire Policy'; what happens if the scheduler is down during a scheduled cron time?",
      "Technical Inaccuracy: Milestone 3 suggests 'Graceful shutdown completes in-progress jobs,' but for long-running jobs, a 'Checkpoint' or 'Re-queue' mechanism is more realistic than waiting indefinitely."
    ],
    "educational_score": 8
  },
  {
    "id": "distributed-cache",
    "issues": [
      "Technical Inaccuracy: Hash ring lookups are O(log N) (binary search on the ring), not O(1) as stated in the AC, unless the ring is implemented as a direct-lookup array (which wastes space).",
      "Logical Gap: Missing 'Thundering Herd' protection; no mention of 'Cache Warming' or 'Request Collapsing' when a key expires."
    ],
    "educational_score": 9
  },
  {
    "id": "gossip-protocol",
    "issues": [
      "Missing logical step for 'Seed Nodes' or 'Bootstrapping', which is required for a new node to join an existing cluster.",
      "The ACs mention periodic state reconciliation but lack a specific requirement for 'Conflict Resolution' logic (e.g., Vector Clocks or Last-Write-Wins), which is essential for convergence."
    ],
    "educational_score": 9
  },
  {
    "id": "2pc-impl",
    "issues": [
      "Missing the 'Uncertainty State' logic for participants: a participant who voted YES must know how to handle the period where the coordinator is unreachable before the decision is received.",
      "Milestone 1 mentions recovery from 'kill-9' before the protocol phases are even defined, which is logically out of order for a learning path."
    ],
    "educational_score": 8
  },
  {
    "id": "service-mesh",
    "issues": [
      "Gap: No mention of a 'Control Plane' (like Istiod). A service mesh requires a mechanism to distribute configuration (like xDS) to the sidecar proxies.",
      "Technical inaccuracy: 'Intercept all traffic via iptables' usually requires elevated privileges or a CNI plugin, which is omitted from the implementation milestones."
    ],
    "educational_score": 7
  },
  {
    "id": "rate-limiter-distributed",
    "issues": [
      "Technical overlap: 'Consistent Hashing' in Milestone 4 is often redundant if using Redis Cluster or a single managed instance; the limiter usually relies on the data store's native sharding.",
      "Missing AC for 'Clock Drift' handling between distributed application nodes, which is mentioned in the 'Essence' but not the implementation steps."
    ],
    "educational_score": 8
  },
  {
    "id": "saga-orchestrator",
    "issues": [
      "Missing definition of the communication transport (e.g., Message Broker vs HTTP); the reliability of the saga depends heavily on the 'Outbox Pattern' or similar reliable messaging.",
      "The AC for 'Idempotent step execution' is mentioned but lacks specific criteria for implementation (e.g., Idempotency Keys)."
    ],
    "educational_score": 9
  },
  {
    "id": "chaos-engineering",
    "issues": [
      "Logical redundancy: Milestone 1 (Fault Injection) and Milestone 5 (Network Chaos) cover the same ground (latency/packet loss).",
      "Missing the concept of 'Blast Radius Control'—a critical safety feature in chaos engineering to prevent experiments from escaping the target environment."
    ],
    "educational_score": 7
  },
  {
    "id": "container-runtime",
    "issues": [
      "Significant gap: Missing the `pivot_root` or `chroot` operation, which is the actual mechanism that traps the process inside the container filesystem.",
      "Missing 'Image Management': A runtime needs to pull and unpack OCI-compliant tarballs before the OverlayFS can mount them."
    ],
    "educational_score": 8
  },
  {
    "id": "kubernetes-operator",
    "issues": [
      "Logical gap: Missing 'Finalizers'. Without finalizers, the operator cannot perform cleanup of external resources (like LoadBalancers or Databases) when a Custom Resource is deleted."
    ],
    "educational_score": 9
  },
  {
    "id": "gitops-deployment",
    "issues": [
      "Technical omission: The system lacks a 'Dry Run' or 'Validation' phase before applying manifests, which is critical to prevent breaking the cluster with invalid YAML.",
      "Gap: No mention of Secret Management (e.g., SealedSecrets or Vault integration), which is a primary hurdle in GitOps workflows."
    ],
    "educational_score": 8
  },
  {
    "id": "build-raft",
    "issues": [
      "Major gap: Missing 'Log Compaction' (Snapshotting). Without snapshots, the log grows indefinitely, making node restarts and recovery impossible in a real-world scenario.",
      "Missing 'Persistence' AC: Raft requires `currentTerm`, `votedFor`, and the `log` to be persisted to stable storage to survive crashes."
    ],
    "educational_score": 8
  },
  {
    "id": "build-distributed-kv",
    "issues": [
      "Technical Inconsistency: The project mixes AP (Dynamo-style) features like Sloppy Quorum and Hinted Handoff with CP (Strong Consistency) features like 2-Phase Commit and Linearizability. These models have conflicting availability/consistency trade-offs.",
      "Logical Gap: 2-Phase Commit (2PC) is mentioned for transactions, but it is notoriously prone to blocking on coordinator failure; a production-ready audit would usually require a 3PC or Paxos/Raft integration."
    ],
    "educational_score": 9
  },
  {
    "id": "infrastructure-as-code",
    "issues": [
      "Logical Gap: The transition from the 'Plan' to 'Apply' milestone is missing a 'Refresh' step, which is critical in IaC to detect drift before generating a diff.",
      "Technical Inaccuracy: Three-way merge is mentioned in the essence but the milestones only describe basic CRUD; implementing a true 3-way merge between State, Config, and Live API is significantly more complex than described."
    ],
    "educational_score": 8
  },
  {
    "id": "serverless-runtime",
    "issues": [
      "Logical Gap: Missing an 'API Gateway' or 'Trigger' milestone. Routing is mentioned, but the mechanism for mapping external events (webhooks, S3 events) to function execution is omitted.",
      "Technical Inaccuracy: Snapshot/Restore (like Firecracker) typically requires specific filesystem and kernel support (CRIU), which is a massive leap in complexity compared to the basic Python/Node packaging described."
    ],
    "educational_score": 8
  },
  {
    "id": "capstone-microservices-platform",
    "issues": [
      "Logical Gap: Implementing automated rollback based on canary error rates is an advanced DevOps task that requires a metrics-driven orchestrator not fully detailed in the 'Observability' or 'CI/CD' milestones.",
      "Technical Inaccuracy: REST to gRPC transformation at the gateway (transcoding) usually requires Protobuf-to-JSON mapping definitions which are not mentioned in the decomposition."
    ],
    "educational_score": 9
  },
  {
    "id": "linear-regression",
    "issues": [
      "Logical Gap: Feature scaling (Normalization) is listed in the final milestone, but Gradient Descent (Milestone 2) will often fail to converge or be extremely inefficient without it.",
      "Missing Step: No mention of data splitting (train/test sets), which is fundamental to evaluating if the model actually learned or just overfit."
    ],
    "educational_score": 7
  },
  {
    "id": "knn",
    "issues": [
      "Technical Inaccuracy: KNN is highly sensitive to the scale of features; the absence of a normalization/standardization step in the milestones is a major educational gap for distance-based models.",
      "Logical Gap: For a 'production-like' audit, the lack of an indexing strategy (like KD-Trees or Ball Trees) for Milestone 1 means the project only works on very small datasets due to O(N) lookup."
    ],
    "educational_score": 7
  },
  {
    "id": "chatbot-intent",
    "issues": [
      "Logical Gap: The 'Response Generation' milestone mentions templates, but there is no logic for 'Dialogue Policy' (deciding the next action), only state tracking.",
      "Technical Inaccuracy: TF-IDF is mentioned for intent classification, but standard NER (Entity Extraction) for names/dates usually requires a sequence model (CRF/Transformers), not a TF-IDF vectorizer."
    ],
    "educational_score": 8
  },
  {
    "id": "neural-network-basic",
    "issues": [
      "Minor Detail: The project is technically sound as a clone of micrograd, though it lacks an 'Optimizer' class to abstract the weight update logic from the training loop."
    ],
    "educational_score": 10
  },
  {
    "id": "word2vec",
    "issues": [
      "Logical Gap: Milestone 2 uses Softmax, but Milestone 3 introduces Negative Sampling. The transition should clarify that Negative Sampling is an optimization to replace the Softmax layer, not an addition to it.",
      "Technical Inaccuracy: Subsampling of frequent words (M1) is usually done during pair generation, not as a standalone preprocessing step, to maintain window integrity."
    ],
    "educational_score": 9
  },
  {
    "id": "rag-system",
    "issues": [
      "Logical Gap: Missing a 'Re-ranking' step. Standard RAG often retrieves 'noisy' chunks; a second stage re-ranker is usually necessary for the quality levels suggested in Milestone 5.",
      "Technical Inaccuracy: Milestone 3 mentions 'Hybrid Search' using BM25, but Milestone 1 doesn't mention building an inverted index, which BM25 requires."
    ],
    "educational_score": 9
  },
  {
    "id": "semantic-search",
    "issues": [
      "Logical Gap: Missing a dedicated milestone for 'Data Preprocessing & Chunking' which is critical for transformer-based embeddings.",
      "Technical Inaccuracy: 'Negative query terms' in vector space usually require specialized algebraic operations or metadata filtering, which isn't addressed in the indexing AC."
    ],
    "educational_score": 9
  },
  {
    "id": "recommendation-engine",
    "issues": [
      "Technical Inaccuracy: Standard SVD cannot be performed directly on sparse matrices with missing values; it requires iterative methods like FunkSVD or ALS (which is mentioned as an alternative but the distinction is important).",
      "Logical Gap: Missing a milestone for evaluation metrics (e.g., Hit Rate@K, NDCG, MRR) which are fundamental before moving to production."
    ],
    "educational_score": 8
  },
  {
    "id": "ml-model-serving",
    "issues": [
      "Logical Gap: No mention of request serialization/deserialization (e.g., Protobuf, JSON) which is a primary bottleneck in high-throughput serving.",
      "Technical Inaccuracy: GPU 'warmup' is usually handled at the model loading stage, but the AC separates them without linking the dependency."
    ],
    "educational_score": 9
  },
  {
    "id": "transformer-scratch",
    "issues": [
      "Logical Gap: The project ends at 'Training', missing the critical 'Inference/Generation' logic (Greedy search vs Beam search) required to actually use the model.",
      "Technical Inaccuracy: AC mentions 'Embedding scaling' which is specific to the original 'Attention Is All You Need' paper but omitted in most modern implementations; its inclusion is educationally accurate but should be noted as optional."
    ],
    "educational_score": 9
  },
  {
    "id": "ai-agent-framework",
    "issues": [
      "Logical Gap: The jump from a single ReAct loop to 'Multi-Agent Collaboration' is a massive complexity leap; missing an intermediate 'Agent Communication Protocol' milestone.",
      "Technical Inaccuracy: JSON parsing of LLM outputs often fails; the AC should explicitly mention 'retry logic' or 'constrained decoding' for structured output."
    ],
    "educational_score": 8
  },
  {
    "id": "llm-eval-framework",
    "issues": [
      "Technical Inaccuracy: BLEU and ROUGE are increasingly considered poor metrics for LLM semantic quality; the framework focuses heavily on statistical overlap rather than modern model-based evaluation.",
      "Logical Gap: Missing 'Prompt Versioning' as a core component of the dataset management milestone."
    ],
    "educational_score": 8
  },
  {
    "id": "llm-finetuning-pipeline",
    "issues": [
      "Logical Gap: Missing 'Sequence Packing' or 'Tokenization Strategy' milestone, which is vital for training efficiency and handling varying instruction lengths.",
      "Technical Inaccuracy: Merging QLoRA 4-bit adapters into the base model often requires de-quantizing to float16 first, which is not clearly defined in the merging AC."
    ],
    "educational_score": 9
  },
  {
    "id": "mlops-platform",
    "issues": [
      "Logical Gap: The scope is excessively broad; 'Model Monitoring' and 'Training Pipelines' are usually separate platforms. Lacks focus on 'Feature Store' integration.",
      "Technical Inaccuracy: Canary deployment usually requires a Load Balancer or Service Mesh layer which is outside the model serving scope mentioned."
    ],
    "educational_score": 7
  },
  {
    "id": "build-nn-framework",
    "issues": [
      "Logical Gap: Missing a 'Loss Functions' milestone (MSE, Cross-Entropy) which is a prerequisite for the 'Optimizers' milestone.",
      "Technical Inaccuracy: Topological sort is mentioned in Autodiff, but the implementation of 'Backpropagation through time' (BPTT) for sequences is ignored."
    ],
    "educational_score": 9
  },
  {
    "id": "build-transformer",
    "issues": [
      "Logical Gap: High redundancy with the 'Transformer from Scratch' project; this version adds 'Text Generation' but lacks the 'Encoder-Decoder' architecture depth.",
      "Technical Inaccuracy: LayerNorm placement (Pre-LN vs Post-LN) is a major architectural decision for stability that is missing from the AC."
    ],
    "educational_score": 7
  },
  {
    "id": "tetris",
    "issues": [
      "Logical Gap: Modern Tetris requires the '7-bag' randomization system for fairness, which is missing from the board initialization criteria.",
      "Technical Inaccuracy: Milestone 3 suggests wall kicks are 'offsets to try,' but standard Tetris (SRS) uses specific, non-intuitive lookup tables for balance."
    ],
    "educational_score": 9
  },
  {
    "id": "platformer",
    "issues": [
      "Logical Gap: Milestone 1 introduces ground collision before Milestone 3 defines the Tile-map system, creating a dependency loop.",
      "Missing Step: Animation state transitions (idle, run, jump, fall) are essential for teaching platformer development but are absent."
    ],
    "educational_score": 8
  },
  {
    "id": "topdown-shooter",
    "issues": [
      "Technical Inaccuracy: The essence mentions 'AI behavior trees,' but Milestone 3 only describes simple 'direct line-of-sight' chasing.",
      "Logical Gap: Projectiles are created in M2, but the memory management (removing off-screen bullets) should be a fundamental part of the projectile class definition, not a later wave-based addition."
    ],
    "educational_score": 8
  },
  {
    "id": "software-3d",
    "issues": [
      "Missing Step: 3D Clipping (specifically Near-Plane clipping) is missing; without it, the renderer will crash or invert geometry when vertices pass behind the camera.",
      "Logical Gap: Perspective Projection is listed in M3, but typically requires the Depth Buffer (M4) to produce any meaningful visual output."
    ],
    "educational_score": 9
  },
  {
    "id": "ecs-arch",
    "issues": [
      "Missing Step: Memory management for 'Entity Command Buffers' is required to handle add/remove operations during system iteration without corrupting the iterator.",
      "Logical Gap: Milestone 4 (Archetypes) is presented as optional, but the 'essence' describes it as a core part of the architecture."
    ],
    "educational_score": 10
  },
  {
    "id": "build-game-engine",
    "issues": [
      "Logical Gap: Resource Management (M4) is listed last, but a rendering foundation (M1) and ECS (M2) cannot practically function without an asset loading system.",
      "Technical Inaccuracy: Implementing both AABB and Circle-to-Circle collision response usually requires a Manifold generator, which is not mentioned in the physics criteria."
    ],
    "educational_score": 8
  },
  {
    "id": "build-raytracer",
    "issues": [
      "Technical Inaccuracy: M1 uses PPM P3 (ASCII), which is educational but technically infeasible for the high sample counts required in M5 (Antialiasing) due to file size and write speed.",
      "Logical Gap: Gamma correction (M6) is introduced after diffuse materials, but ideally should be present from M1 to ensure colors are viewed correctly throughout development."
    ],
    "educational_score": 10
  },
  {
    "id": "calculator-parser",
    "issues": [
      "Logical Gap: Milestone 1 skips Lexing/Tokenization as a prerequisite, implying the parser reads raw characters, which contradicts the 'essence' description.",
      "Technical Inaccuracy: Right-associativity for power operators (M2) usually requires a specific change to the recursive descent structure that isn't highlighted in the AC."
    ],
    "educational_score": 9
  },
  {
    "id": "json-parser",
    "issues": [
      "Technical Inaccuracy: M2 claims 'Recursive Descent' handles deep nesting without stack overflow, but standard recursion is limited by the system stack; a 'true' solution requires an explicit heap-based stack.",
      "Logical Gap: Number format validation (M3) is logically a Lexer concern (M1), not a post-parsing error handling step."
    ],
    "educational_score": 9
  },
  {
    "id": "tokenizer",
    "issues": [
      "Logical Gap: Redundancy between Milestone 1 (identifying types) and Milestone 3 (scanning logic); you cannot identify a multi-character token type without the scanning logic.",
      "Missing Step: The 'Maximal Munch' principle mentioned in the essence is not reflected in the acceptance criteria for operator handling (e.g., distinguishing '>' from '>=')."
    ],
    "educational_score": 7
  },
  {
    "id": "lisp-interp",
    "issues": [
      "Logical Gap: Missing the 'quote' special form. In Lisp, without 'quote', it is impossible to treat lists as data rather than code, which is fundamental to the language essence.",
      "Technical Inaccuracy: Milestone 4 mentions recursion without stack overflow. In most high-level languages used to build an interpreter, this requires explicit Tail Call Optimization (TCO), which is not mentioned in the AC."
    ],
    "educational_score": 8
  },
  {
    "id": "bytecode-vm",
    "issues": [
      "Logical Gap: The constant pool is mentioned in Milestone 1 (Design) but 'Stack-Based Execution' (Milestone 2) doesn't include an instruction to actually load constants (e.g., PUSH_CONST) onto the stack.",
      "Technical Inaccuracy: Milestone 3 suggests jump targets outside bounds are detected during execution; in production VMs, this is typically handled by a bytecode verifier pass prior to execution for performance."
    ],
    "educational_score": 9
  },
  {
    "id": "ast-builder",
    "issues": [
      "Logical Gap: Milestone 2 (Recursive Descent) omits the concept of 'Lookahead' or 'Peeking', which is the technical requirement for a recursive descent parser to decide which production rule to apply.",
      "Technical Inaccuracy: Milestone 3 mentions 'lexical scope boundaries' for block statements, but an AST Builder only represents structure; scope resolution is a semantic analysis task usually performed after the AST is built."
    ],
    "educational_score": 8
  },
  {
    "id": "ast-interpreter",
    "issues": [
      "Logical Gap: Milestone 4 (Closures) mentions capturing variables but doesn't specify how to handle the 'Environment' persistence. A standard naive environment chain will fail if the parent scope is popped from the call stack unless a heap-allocated environment or 'Upvalue' system is used."
    ],
    "educational_score": 9
  },
  {
    "id": "type-checker",
    "issues": [
      "Logical Gap: Milestone 3 mentions Unification but omits the 'Occurs Check'. Without the Occurs Check, the unification algorithm can enter infinite recursion when trying to unify a type variable with a type containing that same variable (e.g., t1 = list<t1>)."
    ],
    "educational_score": 9
  },
  {
    "id": "simple-gc",
    "issues": [
      "Technical Inaccuracy: Milestone 1 defines the object model but fails to include 'Metadata/Type Descriptors' that allow the Mark Phase to identify which fields in an object are pointers vs. primitives.",
      "Logical Gap: Missing a 'Stop-the-world' or 'Safe-point' mechanism. A GC cannot safely walk the stack or mutate pointers while the mutator (the main program) is actively changing references."
    ],
    "educational_score": 7
  },
  {
    "id": "bytecode-compiler",
    "issues": [
      "Logical Gap: Milestone 2 (Variables) omits the 'Scope Analysis' pass. A compiler must distinguish between local variables (stack-indexed) and global/upvalue variables before emitting the instruction, as they use different opcodes."
    ],
    "educational_score": 9
  },
  {
    "id": "wasm-emitter",
    "issues": [
      "Technical Inaccuracy: Milestone 3 describes 'Loop with br_if' as a backward branch. In WASM, jumping to a 'loop' label goes to the start, but jumping to a 'block' label goes to the end. This distinction is critical for structured control flow.",
      "Logical Gap: Milestone 4 mentions function calls by index but omits the 'Function Section' which maps these indices to the 'Type Section' signatures."
    ],
    "educational_score": 8
  },
  {
    "id": "build-linker",
    "issues": [
      "Logical Gap: Milestone 2 and 3 are tightly coupled; symbol resolution must provide the absolute addresses that the relocation phase then patches into the instruction stream.",
      "Technical Inaccuracy: Milestone 4 mentions PT_LOAD segments. For an executable to run 'without external tools' (as per AC), the linker must also define the entry point symbol (usually _start) in the ELF header."
    ],
    "educational_score": 9
  },
  {
    "id": "build-interpreter",
    "issues": [
      "Technical Inaccuracy: Milestone 8 (Closures) mentions 'Variable resolution at compile time' to determine scope depth. This is a specific solution for the 'Lox' tree-walker to fix environment leakage, but it technically moves the project from a pure interpreter toward a hybrid compiler-interpreter model."
    ],
    "educational_score": 10
  },
  {
    "id": "build-gc",
    "issues": [
      "Milestone 1 fails to mention the 'Stop-the-World' mechanism required for consistent root set identification and sweep phases in a basic collector.",
      "The 'Total memory reclaimed' AC is technically imprecise as it ignores heap fragmentation and metadata overhead."
    ],
    "educational_score": 9
  },
  {
    "id": "build-regex",
    "issues": [
      "The milestones focus on formal automata but omit the implementation of 'Capture Groups', which is the most complex part of a practical regex engine.",
      "Does not address the 'Catastrophic Backtracking' educational concept, which is relevant if the engine were to support backreferences."
    ],
    "educational_score": 9
  },
  {
    "id": "build-jit",
    "issues": [
      "Technical Inaccuracy: Mapping memory with PROT_READ|PROT_WRITE|PROT_EXEC simultaneously is forbidden on modern hardened systems (W^X protection); the guide should suggest mapping W then remapping to X.",
      "Logical Gap: Missing a 'Deoptimization' or 'Guard' milestone, which is essential for JITs that make speculative optimizations."
    ],
    "educational_score": 8
  },
  {
    "id": "capstone-programming-language",
    "issues": [
      "Logical Gap: The transition from Bytecode to VM is clear, but the 'Static Analysis' milestone omits the construction of a Symbol Table, which is critical for the described scope resolution.",
      "Mixing Hindley-Milner with 'Generic constraints' is technically non-trivial and may be under-explained for an educational path."
    ],
    "educational_score": 9
  },
  {
    "id": "hash-impl",
    "issues": [
      "Milestone 1 contains redundant Acceptance Criteria (AC 3 and 4 describe the same length-padding step).",
      "The description of the padding logic '448 mod 512' is correct, but the implementation usually requires handling the case where the message length is very close to the block boundary, requiring an extra block."
    ],
    "educational_score": 10
  },
  {
    "id": "password-hashing",
    "issues": [
      "Logical Gap: Missing 'Peppering' (server-side secret) as a defense-in-depth concept.",
      "Inaccuracy: Conflates PBKDF2 iterations (flat count) with bcrypt/Argon2 cost factors (logarithmic/memory-hard) in the description."
    ],
    "educational_score": 8
  },
  {
    "id": "aes-impl",
    "issues": [
      "Logical Gap: Does not mention 'Constant-time implementation' for the S-Box lookup, which is a major security consideration for side-channel attacks in software AES.",
      "Missing Milestone for 'Padding Oracle' defense education when discussing CBC mode."
    ],
    "educational_score": 9
  },
  {
    "id": "jwt-impl",
    "issues": [
      "Logical Gap: Omits Asymmetric Signing (RS256/EdDSA), which is the industry standard for cross-service authentication.",
      "Educational Gap: Should include a specific AC for rejecting the 'alg: none' vulnerability."
    ],
    "educational_score": 7
  },
  {
    "id": "session-management",
    "issues": [
      "Logical Gap: Milestone 2 lacks the most critical defense against Session Fixation: rotating the Session ID upon privilege escalation (login)."
    ],
    "educational_score": 9
  },
  {
    "id": "audit-logging",
    "issues": [
      "Technical Inaccuracy: The 'Essence' mentions Merkle trees for O(log N) verification, but the 'Milestones' only describe linear Hash Chaining (O(N) verification).",
      "Logical Gap: Missing a 'Log Sanitization' step to ensure PII (Personally Identifiable Information) is not leaked into the immutable log."
    ],
    "educational_score": 7
  },
  {
    "id": "sandbox",
    "issues": [
      "Missing User Namespaces (CLONE_NEWUSER), which are essential for running unprivileged containers without root.",
      "Cgroup implementation details differ significantly between Cgroups v1 and v2; the audit lacks version-specific guidance.",
      "The order of namespace creation matters for security (e.g., User Namespace should be created first)."
    ],
    "educational_score": 9
  },
  {
    "id": "https-client",
    "issues": [
      "Critical Logical Gap: Completely missing Certificate Chain Verification. An HTTPS client without X.509 validation is vulnerable to MITM.",
      "Technical Inaccuracy: TLS 1.3 (implied by HKDF/AEAD) does not use the 'Session ID' for the same purpose as 1.2; it is primarily for middlebox compatibility.",
      "Missing handling of the 'ServerHello' 'Supported Versions' extension, which is mandatory for TLS 1.3 negotiation."
    ],
    "educational_score": 7
  },
  {
    "id": "oauth2-provider",
    "issues": [
      "Logical Gap: PKCE (Proof Key for Code Exchange) is mentioned in the essence but absent from the authorization/token endpoint milestones.",
      "Missing OpenID Connect Discovery (.well-known/openid-configuration) and JWKS endpoints, which are required for standard OIDC clients.",
      "Authorization codes must have a short TTL (time-to-live), which is not specified in the acceptance criteria."
    ],
    "educational_score": 8
  },
  {
    "id": "rbac-system",
    "issues": [
      "Logical Gap: Missing the Policy Enforcement Point (PEP) implementation—the actual integration layer that intercepts requests.",
      "Technical Inaccuracy: ABAC evaluation is generally not modeled as a 'DAG traversal' (that applies to RBAC hierarchy); ABAC uses boolean predicate logic.",
      "Does not address 'Deny' logic priority in the hierarchical model."
    ],
    "educational_score": 8
  },
  {
    "id": "secret-management",
    "issues": [
      "Logical Gap: Missing an 'Identity' layer. Vaults typically map external identities (K8s, AWS, LDAP) to internal tokens.",
      "Technical Inaccuracy: While Shamir's splits the Master Key, modern vaults use it to decrypt an 'Unseal Key' which then decrypts the 'Root Key' to avoid re-splitting on every use.",
      "Missing Audit Log requirements for secret access."
    ],
    "educational_score": 9
  },
  {
    "id": "fuzzer",
    "issues": [
      "Minor Gap: Does not explicitly mention 'Deterministic' vs 'Non-deterministic' mutation phases, which is key for efficiency.",
      "The workflow is technically sound and follows the AFL/LibFuzzer model closely."
    ],
    "educational_score": 10
  },
  {
    "id": "vulnerability-scanner",
    "issues": [
      "Logical Gap: Missing authenticated scanning (scanning with credentials), which is a core feature of modern scanners.",
      "Technical Inaccuracy: UDP scanning is notoriously unreliable as it relies on ICMP Port Unreachable messages, which are often rate-limited or dropped.",
      "Vulnerability detection based solely on version banners (Milestone 4) is prone to high false-positive rates due to backported security patches."
    ],
    "educational_score": 9
  },
  {
    "id": "binary-patcher",
    "issues": [
      "Technical Inaccuracy: Adding a new section (.inject) to an existing ELF often requires shifting all subsequent segments or finding 'code caves', which is more complex than described.",
      "Logical Gap: Does not account for Address Space Layout Randomization (ASLR) when using ptrace to target specific memory offsets in a running process.",
      "Instruction-level patching must account for instruction alignment and variable-length encodings (x86)."
    ],
    "educational_score": 8
  },
  {
    "id": "build-tls",
    "issues": [
      "Technical Inaccuracy: In TLS 1.3, the 'Pre-master secret' terminology is replaced by a secret hierarchy (Handshake Secret, Master Secret) derived via HKDF; it is not a single value.",
      "Logical Gap: Missing Key Update and Alert protocol handling for graceful termination and security.",
      "Missing OCSP stapling or CRL checks in the certificate verification milestone."
    ],
    "educational_score": 9
  },
  {
    "id": "markdown-renderer",
    "issues": [
      "Logical Gap: Missing 'Link Reference Definitions' (e.g., [1]: url), a common failure point in custom parsers.",
      "Missing 'Statefulness' in list parsing (tracking indentation levels for nested lists across multiple lines).",
      "Technical Inaccuracy: Escaping should occur during the generation phase, but the milestones don't specify handling of raw HTML within the Markdown source (Sanitization)."
    ],
    "educational_score": 9
  },
  {
    "id": "hexdump",
    "issues": [
      "Standard hexdump defaults to 2-byte units in little-endian display, whereas xxd defaults to 2-byte groups for readability; the distinction between memory-order and display-grouping is often confused in AC 3.",
      "AC 4 mentions using dash '-' as a convention for stdin, but many standard tools handle 'no file' as stdin by default; explicitly requiring a dash might deviate from POSIX expectations."
    ],
    "educational_score": 9
  },
  {
    "id": "diff-tool",
    "issues": [
      "AC 4 in LCS Algorithm claims O(mn) space complexity; for large files, this is a significant technical bottleneck. Educational projects should emphasize the Hirschberg linear-space refinement or Myers' O(ND) algorithm to avoid memory exhaustion.",
      "Encoding detection (UTF-8 vs Latin-1) is suggested in AC 1 but is an 'AI-hard' problem; a basic tool should usually assume a specific encoding or rely on the environment locale."
    ],
    "educational_score": 8
  },
  {
    "id": "elf-parser",
    "issues": [
      "The jump from parsing headers (AC 1) to resolving relocations (AC 2) is steep, as relocations require mapping symbols to section data and understanding specific architecture relocation types (R_X86_64_RELATIVE, etc.).",
      "Parsing 'complete ELF summary similar to readelf -a' (AC 4) includes Notes, Versioning info, and GNU-specific attributes which are not covered in the previous milestones."
    ],
    "educational_score": 9
  },
  {
    "id": "config-parser",
    "issues": [
      "Logical Gap: The complexity of a YAML parser (even a subset) is orders of magnitude higher than INI/TOML due to indentation-based state; treating it as a single milestone alongside INI is unbalanced.",
      "YAML 'type inference' (AC 4) is highly complex (e.g., distinguishing strings from timestamps or booleans like 'yes/no' in older specs)."
    ],
    "educational_score": 7
  },
  {
    "id": "packet-sniffer",
    "issues": [
      "Logical Gap: Milestone 5 mentions supporting BPF filter expressions. Implementing a BPF compiler or evaluator is a project in itself; usually, this AC implies passing the string to libpcap, but 'Raw packet capture' (AC 1) implies a lower-level implementation.",
      "Missing AC for handling Ethernet FCS (Frame Check Sequence) or VLAN tags which shift header offsets."
    ],
    "educational_score": 8
  },
  {
    "id": "profiler",
    "issues": [
      "Technical Inaccuracy: Capturing kernel stack frames (AC 2) typically requires privileged access and specific OS syscalls (like perf_event_open on Linux), which differs significantly from the user-space signal handling used for user stacks.",
      "AC 3 in Memory Profiling mentions detecting leaks; this requires tracking the 'lifetime' of an object (map of address to stack), which is logically distinct from the 'sampling' approach used in CPU profiling."
    ],
    "educational_score": 9
  },
  {
    "id": "simd-library",
    "issues": [
      "AC 1 in String Operations: Finding null terminators with SIMD (strlen) requires careful handling of 'page boundaries' to avoid reading into unmapped memory and causing a Segfault; this is a critical safety gap in the AC.",
      "Dot product (AC 3) with horizontal adds is often slower than a sequence of 'multiply-add-reduce' in modern AVX; horizontal adds (phadd) are notoriously high-latency on older Intel architectures."
    ],
    "educational_score": 10
  },
  {
    "id": "disassembler",
    "issues": [
      "AC 2/3: x86 instruction length is not fixed; the parser must determine length *during* decoding to find the next instruction boundary. The milestones imply a linear flow that doesn't emphasize this 'length-decoding' loop.",
      "ModRM/SIB (AC 4): In 64-bit mode, many instructions use 'RIP-relative' addressing, which requires the disassembler to know the absolute address of the *next* instruction to calculate the target."
    ],
    "educational_score": 9
  },
  {
    "id": "terminal-multiplexer",
    "issues": [
      "Logical Gap: The project is called a 'Multiplexer' but lacks the 'Detach/Attach' milestone. Without the ability to persist a session when the parent process exits, it is technically a 'Terminal Emulator with Tiling' rather than a Multiplexer (like tmux).",
      "AC 2 in Window Management: Resizing panes requires a 'reflow' algorithm for the internal scrollback buffer, which is extremely complex and not mentioned."
    ],
    "educational_score": 7
  },
  {
    "id": "protocol-buffer",
    "issues": [
      "Technical Inaccuracy: AC 2 in Varints mentions ZigZag for 'signed integers'. While correct for sint32/sint64, standard 'int32' uses 10-byte sign-extended varints (not ZigZag) for negative numbers in Protobuf.",
      "AC 4: Deserializing into a Python 'dict' loses the strict typing and field-number-to-name mapping unless the schema is dynamically loaded or compiled into the tool logic."
    ],
    "educational_score": 9
  },
  {
    "id": "payment-gateway",
    "issues": [
      "Missing compliance and security milestone (PCI-DSS scope, encryption at rest, and tokenization of sensitive card data).",
      "Logical gap: Does not specify a 'Settlement' or 'Payout' phase to move funds from the gateway to the merchant."
    ],
    "educational_score": 9
  },
  {
    "id": "subscription-billing",
    "issues": [
      "Missing 'Invoicing' milestone; legal compliance for recurring billing requires invoice generation and tax calculation.",
      "Missing 'Dunning Management' (handling failed recurring payments with retry logic and customer notifications)."
    ],
    "educational_score": 8
  },
  {
    "id": "webhook-delivery",
    "issues": [
      "Logical gap: 'Validation of endpoint ownership' should ideally happen before 'Delivery Queue' implementation to prevent the system from being used for DDoS.",
      "Technical nuance: 'Ordering guarantees per endpoint' (Milestone 2) creates a head-of-line blocking risk during retries that isn't addressed."
    ],
    "educational_score": 9
  },
  {
    "id": "cdn-implementation",
    "issues": [
      "Logical gap: Routing and Edge Node Distribution (Milestone 4) is the entry point and should be Milestone 1.",
      "Technical inaccuracy: Consistent hashing is used for cache key distribution, but routing to the 'nearest' node (Milestone 4) typically uses Anycast BGP or Geo-DNS, not consistent hashing."
    ],
    "educational_score": 8
  },
  {
    "id": "order-matching-engine",
    "issues": [
      "Technical contradiction: Essence claims O(1) insertion, but Milestone 1 AC specifies O(log n). Real-time engines usually achieve O(1) using Doubly Linked Lists mapped by Hash Maps at each price level.",
      "Missing critical 'Recovery' milestone: Matching engines must be able to reconstruct state from a WAL (Write-Ahead Log) or snapshot after a crash."
    ],
    "educational_score": 7
  },
  {
    "id": "ledger-system",
    "issues": [
      "Technical inconsistency: Essence mentions 'cryptographic chaining' for tamper-evidence, but this requirement is absent from the Milestones/AC.",
      "Missing 'Close of Books' logic or 'Period Locking' to prevent entries into historical periods."
    ],
    "educational_score": 9
  },
  {
    "id": "lock-free-structures",
    "issues": [
      "Logical gap: Safe Memory Reclamation (Hazard Pointers, Milestone 4) is a prerequisite for a functional Lock-free Queue or Hash Map (Milestones 3, 5) to prevent use-after-free crashes during concurrent pops/deletes."
    ],
    "educational_score": 9
  },
  {
    "id": "cache-optimized-structures",
    "issues": [
      "No major technical inaccuracies; highly accurate representation of spatial locality and memory hierarchy optimization."
    ],
    "educational_score": 10
  },
  {
    "id": "build-ebpf-tracer",
    "issues": [
      "Missing 'Verifier' education: A key part of eBPF is understanding the kernel verifier's constraints (e.g., loop limits, pointer arithmetic).",
      "Technical nuance: Milestone 1 should mention the need for kernel headers or BTF (BPF Type Format) for portability (CO-RE)."
    ],
    "educational_score": 9
  },
  {
    "id": "build-git",
    "issues": [
      "Logical gap: The 'Index/Staging' (Milestone 6) should precede 'Tree Objects' (Milestone 3), as `write-tree` in Git logic specifically snapshots the current Index.",
      "Missing 'Packfiles' milestone: Storing every version as a loose compressed file is inefficient; delta-compression via packfiles is essential for Git's scalability."
    ],
    "educational_score": 9
  },
  {
    "id": "build-text-editor",
    "issues": [
      "Logical Gap: Basic terminal window size detection (ioctl TIOCGWINSZ) is missing but required for correct screen refresh and scrolling calculations.",
      "Logical Gap: Milestone 4 (Text Editing) should precede Milestone 2 (Screen Refresh) to ensure there is content to render and manage."
    ],
    "educational_score": 9
  },
  {
    "id": "build-bittorrent",
    "issues": [
      "Logical Gap: Missing the 'Interested/Not Interested' and 'Choking/Unchoking' state machine initialization before starting the Piece Management phase.",
      "Technical Inaccuracy: Milestone 3 mentions transferring blocks without specifying the pipelining of requests, which is essential for performance in high-latency swarms."
    ],
    "educational_score": 10
  },
  {
    "id": "build-dns",
    "issues": [
      "Technical Inaccuracy: Does not address the Truncation (TC) bit or the requirement to fall back to TCP when DNS responses exceed the 512-byte UDP limit.",
      "Logical Gap: Missing handling for CNAME records, which can cause recursion loops or require multiple resolution steps for a single query."
    ],
    "educational_score": 8
  },
  {
    "id": "build-debugger",
    "issues": [
      "Logical Gap: Milestone 2 describes hitting a breakpoint but fails to mention the 'Step-over' logic required to resume execution (temporarily removing the breakpoint, single-stepping, then re-inserting it).",
      "Technical Inaccuracy: ptrace behavior varies significantly by architecture; specific mention of x86-specific IP-1 adjustment should be caveated for portability."
    ],
    "educational_score": 9
  },
  {
    "id": "build-lsp",
    "issues": [
      "Logical Gap: Missing the critical 'Position Mapping' step where LSP UTF-16 line/character offsets are converted to the server's internal AST byte offsets.",
      "Technical Inaccuracy: Document synchronization (Milestone 2) should explicitly mention handling out-of-order notifications using version numbers."
    ],
    "educational_score": 8
  },
  {
    "id": "build-emulator",
    "issues": [
      "Logical Gap: Missing an Interrupt Handling milestone; without IRQ/NMI logic, peripheral communication (like V-Blank for graphics) cannot be accurately emulated.",
      "Technical Inaccuracy: 'Cycle-accurate' timing usually requires sub-instruction state modeling, which is not reflected in the high-level fetch-decode-execute milestone."
    ],
    "educational_score": 9
  },
  {
    "id": "build-browser",
    "issues": [
      "Logical Gap: Missing the 'Render Tree' construction phase where the DOM and CSSOM are merged to filter out non-visual elements (e.g., <script>, display: none) before layout begins.",
      "Technical Inaccuracy: Milestone 3 implies horizontal flow for all inline elements, neglecting Right-to-Left (RTL) or vertical text layout complexities."
    ],
    "educational_score": 8
  },
  {
    "id": "multiplayer-game-server",
    "issues": [
      "Logical Gap: Milestone 4 (State Sync) should be established before Milestone 2 (Prediction/Reconciliation), as prediction cannot be validated without a functioning sync protocol.",
      "Technical Inaccuracy: Does not mention 'Jitter Buffering' which is necessary alongside interpolation to handle inconsistent packet arrival times."
    ],
    "educational_score": 9
  },
  {
    "id": "build-vpn",
    "issues": [
      "Logical Gap: Milestone 1 mentions reading packets but the project lacks a milestone for the initial Handshake/Session establishment logic before encrypted data starts flowing.",
      "Technical Inaccuracy: Milestone 5 mentions 'Server NAT' but neglects the need for MTU/MSS clamping to prevent packet fragmentation issues common in encapsulated tunnels."
    ],
    "educational_score": 10
  },
  {
    "id": "unit-testing-basics",
    "issues": [
      "Logical Gap: Missing a 'Test Discovery' step; understanding how a runner finds and executes tests in a project structure is a fundamental hurdle.",
      "Educational Gap: The jump from simple assertions to mocking is steep; it lacks a middle step for testing stateful objects or dependency injection basics."
    ],
    "educational_score": 7
  },
  {
    "id": "logging-structured",
    "issues": [
      "Missing log rotation and retention strategies, leading to potential disk exhaustion.",
      "No mention of backpressure handling or local buffering for remote collector failures.",
      "Omission of schema versioning for the JSON output to handle evolving log structures."
    ],
    "educational_score": 9
  },
  {
    "id": "ci-cd-pipeline",
    "issues": [
      "Critical gap: No mention of secret/credential management (e.g., masking tokens in logs).",
      "Missing workspace/environment cleanup logic between job runs to ensure isolation.",
      "AC mentions topological sort but lacks logic for handling circular dependencies in the DAG."
    ],
    "educational_score": 8
  },
  {
    "id": "integration-testing",
    "issues": [
      "Lack of network isolation AC; parallel tests may conflict on shared ports despite containerization.",
      "Missing 'wait-for-it' logic or readiness probes for containers before test execution.",
      "No mention of deterministic time/clock mocking for testing time-sensitive async operations."
    ],
    "educational_score": 9
  },
  {
    "id": "cd-deployment",
    "issues": [
      "Incomplete cutover logic: missing handling for session stickiness/persistence during the traffic flip.",
      "Readiness probes are mentioned for the LB but not for the initial 'Cold' startup of the inactive environment.",
      "Omission of 'Stop-the-world' vs 'Graceful' connection draining parameters in the Nginx reload AC."
    ],
    "educational_score": 9
  },
  {
    "id": "metrics-dashboard",
    "issues": [
      "Logical gap: storage AC ignores data downsampling (rollups) required for long-term historical views.",
      "Ambiguity in 'Prometheus support': does not specify if it supports 'Pull' scraping or 'Push' gateway ingestion.",
      "Visualization AC lacks 'Template Variables' (e.g., filtering all panels by $cluster)."
    ],
    "educational_score": 8
  },
  {
    "id": "load-testing-framework",
    "issues": [
      "Technical inaccuracy: Reporting latency percentiles without addressing 'Coordinated Omission' leads to skewed results.",
      "Missing resource monitoring (CPU/RAM) for worker nodes to detect when the generator becomes the bottleneck.",
      "No mention of IP spoofing or source-port exhaustion management for high-throughput VUs."
    ],
    "educational_score": 9
  },
  {
    "id": "log-aggregator",
    "issues": [
      "Architectural gap: Missing the distinction between the 'Forwarder' (agent) and the 'Indexer' (aggregator).",
      "No mention of 'Schema-on-read' vs 'Schema-on-write' trade-offs in the Query Engine AC.",
      "Ingestion AC claims 10k msg/s but lacks horizontal scaling or partitioning logic to achieve it."
    ],
    "educational_score": 8
  },
  {
    "id": "alerting-system",
    "issues": [
      "Critical Gap: No mention of state persistence; 'Pending' durations would reset on every service restart.",
      "Missing 'Inhibition' logic details: how the system prevents child alerts when a parent (e.g., DataCenterDown) is firing.",
      "Lack of notification 'Flapping' protection for metrics hovering exactly on the threshold."
    ],
    "educational_score": 9
  },
  {
    "id": "apm-system",
    "issues": [
      "Technical complexity gap: Tail-based sampling AC oversimplifies the need for a global trace buffer/state.",
      "Missing clock skew correction logic for spans originating from different servers in the distributed trace.",
      "No mention of 'Span link' support for asynchronous messaging patterns where parent-child nesting is broken."
    ],
    "educational_score": 8
  },
  {
    "id": "metrics-collector",
    "issues": [
      "Inaccuracy: Gorilla-style XOR encoding is highly sensitive to out-of-order samples, which are not addressed.",
      "Missing 'Staleness' handling: markers needed to identify when a metric series has stopped reporting.",
      "Scrape engine lacks 'Jitter' logic, which is required to prevent 'Thundering Herd' scenarios on scrape targets."
    ],
    "educational_score": 9
  },
  {
    "id": "build-test-framework",
    "issues": [
      "Logical Gap: Missing 'Global Hooks' (beforeAll/afterAll) which are standard for database seeding or server startup in test suites.",
      "Logical Gap: Does not define the isolation mechanism (process forking vs. threading), which is critical for the 'Parallel execution' AC.",
      "Technical Inaccuracy: 'Assertion introspection' usually requires AST transformation or frame inspection to show variable names/values in failures, which is not reflected in the basic AC requirements."
    ],
    "educational_score": 8
  },
  {
    "id": "build-ci-system",
    "issues": [
      "Logical Gap: Missing 'Workspace Cleanup' and 'Artifact Retention' policies; without these, workers will exhaust disk space rapidly.",
      "Logical Gap: Missing a 'Caching' layer (e.g., node_modules or docker layers), which is the primary bottleneck in CI performance.",
      "Technical Inaccuracy: The 'Step execution' AC implies a linear sequence but does not specify how to handle environment variable persistence between separate shell processes/container layers."
    ],
    "educational_score": 9
  },
  {
    "id": "build-observability-platform",
    "issues": [
      "Logical Gap: Missing 'Tail Sampling' logic; ingesting 100% of traces at high volume (10k events/sec) is cost-prohibitive and technically unnecessary.",
      "Logical Gap: Missing 'Service Discovery' or 'Topology Mapping' to visualize the relationships between signals.",
      "Technical Inaccuracy: Achieving 500ms full-text search on 1M logs while simultaneously handling high-volume ingestion requires specific indexing strategies (e.g., inverted indices) not mentioned in the storage AC."
    ],
    "educational_score": 8
  },
  {
    "id": "ad-exchange-engine",
    "issues": [
      "Logical Gap: Missing 'Budget Pacing' algorithms; without pacing, budgets are exhausted in seconds, leading to uneven delivery.",
      "Technical Inaccuracy: '100GB/s' telemetry processing on a single engine exceeds standard PCIe/Memory bandwidth for typical server hardware; this throughput requires a distributed stream processing architecture.",
      "Logical Gap: No mention of 'Creative Validation' or 'Ad Markup' sanitization, which are essential for exchange security."
    ],
    "educational_score": 7
  },
  {
    "id": "mmo-engine-core",
    "issues": [
      "Logical Gap: Missing 'Clock Synchronization' (e.g., Precision Time Protocol or custom NTP); 'The Rollback Boss' cannot function without a shared temporal reference between client and server.",
      "Logical Gap: Missing 'Persistence/World State Save' logic to bridge in-memory spatial data with a durable database.",
      "Technical Inaccuracy: SIMD-accelerated frustum culling for 100k entities is feasible, but performing a full rollback/resimulate of 100k entities in <1ms is physically impossible on current CPU architectures due to cache misses."
    ],
    "educational_score": 8
  },
  {
    "id": "mlops-pipeline-auto",
    "issues": [
      "Logical Gap: Missing 'Model Registry'; there is no defined bridge or versioning system between the Training Orchestrator and the Serving layer.",
      "Logical Gap: Missing 'Data Validation' (e.g., schema enforcement) at the ingestion point; training on corrupted data is the leading cause of MLOps failure.",
      "Technical Inaccuracy: 'Sub-20ms retrieval for 1000+ features' is extremely optimistic for a feature store unless specifically using a localized sidecar or shared memory, which isn't specified."
    ],
    "educational_score": 7
  },
  {
    "id": "distributed-consensus-raft",
    "issues": [
      "Logical Gap: Missing 'Linearizable Reads' (Read Index/Lease); without this, the system may return stale data from the leader during a partition.",
      "Logical Gap: Missing 'Pre-Vote' phase; without it, a partitioned node with a high term can disrupt a healthy cluster upon reconnection.",
      "Technical Inaccuracy: 'Joint Consensus' is mentioned, but the simpler 'single-node-at-a-time' membership change is often preferred for educational implementations to avoid the complexity of overlapping configurations."
    ],
    "educational_score": 9
  }
]