{
  "title": "Blue Origin: A Foundational CDN for Learning Distributed Systems",
  "overview": "This project builds a foundational Content Delivery Network (CDN) that accelerates web content delivery by caching copies at geographically distributed 'edge' servers. The key architectural challenge is designing a multi-tiered, consistent, and resilient caching system that dramatically reduces latency and origin load while handling real-world complexities like invalidation and request storms.",
  "sections": [
    {
      "id": "context-problem",
      "title": "Context and Problem Statement",
      "summary": "Defines the problem of web content delivery at scale, introduces the CDN as a solution, and explains why building one is a challenging distributed systems problem. Maps to understanding the 'why' before the 'how'.",
      "subsections": [
        {
          "id": "analogy",
          "title": "Mental Model: The Global Library System",
          "summary": "Explains a CDN using the analogy of a central library (origin) vs. local branch libraries (edge caches)."
        },
        {
          "id": "problem",
          "title": "The Core Delivery Problem",
          "summary": "Describes latency, origin overload, and availability challenges in serving global users from a single server."
        },
        {
          "id": "existing-solutions",
          "title": "Existing Approaches & Vocabulary",
          "summary": "Compares commercial CDNs (Cloudflare, Akamai), open-source proxies (Varnish, NGINX), and introduces key terms like edge, origin, and cache hit."
        }
      ]
    },
    {
      "id": "goals-nongoals",
      "title": "Goals and Non-Goals",
      "summary": "Clearly scopes the educational project, defining what the system must achieve (e.g., caching, invalidation) and what is out of scope (e.g., DDoS protection, full TLS termination).",
      "subsections": [
        {
          "id": "goals",
          "title": "Goals (What We Must Build)",
          "summary": "List of functional requirements aligned with the five project milestones."
        },
        {
          "id": "nongoals",
          "title": "Non-Goals (What We Explicitly Won't Build)",
          "summary": "Explicitly lists out-of-scope features to maintain focus, such as video transcoding or Web Application Firewall (WAF)."
        }
      ]
    },
    {
      "id": "high-level-arch",
      "title": "High-Level Architecture",
      "summary": "Presents the bird's-eye view of the CDN's components—Client, Edge Nodes, Origin Shield, Origin, and Control Plane—and how they connect. Corresponds to the overall system blueprint.",
      "subsections": [
        {
          "id": "component-overview",
          "title": "Component Overview & Responsibilities",
          "summary": "Describes each major component's role in the system."
        },
        {
          "id": "file-structure",
          "title": "Recommended File/Module Structure",
          "summary": "Provides a suggested Python package structure to organize the codebase from the start."
        }
      ]
    },
    {
      "id": "data-model",
      "title": "Data Model",
      "summary": "Defines the core data structures that power the CDN, primarily focusing on the Cache Entry and related metadata. This is the 'shape' of the data flowing through the system.",
      "subsections": [
        {
          "id": "cache-entry",
          "title": "Core: The Cache Entry",
          "summary": "Defines the structure holding a cached HTTP response, its headers, body, and metadata like TTL and tags."
        },
        {
          "id": "invalidation-structures",
          "title": "Structures for Invalidation",
          "summary": "Describes data models for tracking Surrogate Keys (tags) and Ban patterns."
        },
        {
          "id": "analytics-structures",
          "title": "Structures for Analytics",
          "summary": "Defines metrics counters and structures for tracking performance (hits, misses, bandwidth)."
        }
      ]
    },
    {
      "id": "component-edge-cache",
      "title": "Component: Edge Cache (Milestone 1 & 5)",
      "summary": "Details the HTTP caching logic at the edge, the heart of Milestone 1. Covers request handling, cache key generation, TTL logic, and serving logic, plus analytics and compression from Milestone 5.",
      "subsections": [
        {
          "id": "mental-model-edge",
          "title": "Mental Model: The Smart Mailroom",
          "summary": "Analogy for the edge cache as a mailroom that stores, validates, and efficiently retrieves packages (responses)."
        },
        {
          "id": "interface-edge",
          "title": "Interface & HTTP Flow",
          "summary": "Describes the HTTP handler interface and the step-by-step algorithm for processing a request."
        },
        {
          "id": "cache-key-ttl",
          "title": "Cache Key & TTL Management",
          "summary": "Deep dive into constructing unique cache keys and the hierarchy of TTL directives (s-maxage, max-age)."
        },
        {
          "id": "adr-cache-policy",
          "title": "ADR: Cache Storage & Eviction Policy",
          "summary": "Decision record for choosing an in-memory LRU cache vs. disk-based or external systems."
        },
        {
          "id": "pitfalls-edge",
          "title": "Common Pitfalls in Edge Caching",
          "summary": "Lists common mistakes like mishandling Vary headers, confusing s-maxage, and cache key collisions."
        },
        {
          "id": "impl-edge",
          "title": "Implementation Guidance for Edge Cache",
          "summary": "Technology table, starter HTTP utilities, and skeleton code for the core cache logic (Layer 2)."
        }
      ]
    },
    {
      "id": "component-cache-invalidation",
      "title": "Component: Cache Invalidation (Milestone 2)",
      "summary": "Covers the design for purging cached content via URL, pattern (ban), and tags (Surrogate Keys), including propagation to other nodes.",
      "subsections": [
        {
          "id": "mental-model-invalidation",
          "title": "Mental Model: The Building Eviction Notice",
          "summary": "Compares hard purge (immediate eviction), soft purge (notice to renew lease), and ban (evicting everyone on a floor) to invalidation types."
        },
        {
          "id": "invalidation-types",
          "title": "Purge, Ban, and Tag-Based Invalidation",
          "summary": "Detailed algorithms for each invalidation method and their respective APIs."
        },
        {
          "id": "propagation",
          "title": "Invalidation Propagation Strategy",
          "summary": "Describes how a purge command on one edge node is communicated to all others (e.g., via pub/sub or control plane)."
        },
        {
          "id": "adr-propagation",
          "title": "ADR: Invalidation Propagation Mechanism",
          "summary": "Decision record comparing immediate broadcast, eventual consistency via log, and hybrid approaches."
        },
        {
          "id": "pitfalls-invalidation",
          "title": "Common Pitfalls in Invalidation",
          "summary": "Warns about unbounded ban lists, race conditions during revalidation, and propagation delays."
        },
        {
          "id": "impl-invalidation",
          "title": "Implementation Guidance for Invalidation",
          "summary": "Starter code for a simple pub/sub channel and skeleton for the purge API handler (Layer 2)."
        }
      ]
    },
    {
      "id": "component-origin-shield",
      "title": "Component: Origin Shield & Request Collapsing (Milestone 3)",
      "summary": "Designs the intermediate cache tier (shield) that protects the origin server by collapsing duplicate requests and queueing others.",
      "subsections": [
        {
          "id": "mental-model-shield",
          "title": "Mental Model: The Concert Vestibule",
          "summary": "Analogy for the shield as a venue vestibule that groups people (requests) going to the same seat, preventing a stampede to the main hall (origin)."
        },
        {
          "id": "shield-request-collapsing",
          "title": "Shield Logic & Request Collapsing",
          "summary": "Step-by-step behavior of the shield, including request deduplication, queuing, and negative caching."
        },
        {
          "id": "adr-shielding",
          "title": "ADR: To Shield or Not To Shield",
          "summary": "Decision record analyzing the trade-off of added latency vs. origin protection, guiding when to deploy a shield."
        },
        {
          "id": "pitfalls-shield",
          "title": "Common Pitfalls in Shielding",
          "summary": "Highlights issues like cache poisoning between edges, timeout mismatches causing client drops, and health check complexity."
        },
        {
          "id": "impl-shield",
          "title": "Implementation Guidance for Origin Shield",
          "summary": "Skeleton code for the request coalescing map and the shield's HTTP client with queuing (Layer 2)."
        }
      ]
    },
    {
      "id": "component-edge-distribution",
      "title": "Component: Edge Node Distribution & Routing (Milestone 4)",
      "summary": "Architects the multi-node CDN with geo-routing, health checking, and consistent hashing for cache distribution.",
      "subsections": [
        {
          "id": "mental-model-georouting",
          "title": "Mental Model: The Air Traffic Control Map",
          "summary": "Explains geo-routing and failover using the analogy of an air traffic control system directing planes (requests) to the nearest open airport (edge node)."
        },
        {
          "id": "geo-routing-health",
          "title": "Geo-Routing & Health Checking",
          "summary": "Describes how client IPs are mapped to edge nodes and how node health is monitored and acted upon."
        },
        {
          "id": "consistent-hashing",
          "title": "Consistent Hashing for Cache Distribution",
          "summary": "Explains the use of consistent hashing to distribute cache load across edges and minimize reshuffling on node failure."
        },
        {
          "id": "adr-routing-mech",
          "title": "ADR: Client Routing Mechanism",
          "summary": "Decision record comparing DNS-based geo-routing, Anycast, and HTTP redirects for directing clients."
        },
        {
          "id": "pitfalls-distribution",
          "title": "Common Pitfalls in Distribution",
          "summary": "Covers GeoIP inaccuracy, thundering herd on failover, and cache inconsistency ('cold starts') on new nodes."
        },
        {
          "id": "impl-distribution",
          "title": "Implementation Guidance for Distribution",
          "summary": "Starter code for a simple health check endpoint and skeleton for a consistent hashing ring (Layer 2)."
        }
      ]
    },
    {
      "id": "interactions-data-flow",
      "title": "Interactions and Data Flow",
      "summary": "Traces the journey of a user request through the entire system with sequence diagrams and describes key control messages between components.",
      "subsections": [
        {
          "id": "flow-cache-hit",
          "title": "Data Flow: Cache Hit at Edge",
          "summary": "Sequence of events when a user request is served directly from the edge cache."
        },
        {
          "id": "flow-cache-miss",
          "title": "Data Flow: Cache Miss with Origin Shield",
          "summary": "Sequence of events for a miss, including request collapsing at the shield and origin fetch."
        },
        {
          "id": "flow-invalidation",
          "title": "Control Flow: Global Cache Invalidation",
          "summary": "Sequence showing how a purge command propagates from an admin API to all edge nodes."
        }
      ]
    },
    {
      "id": "error-handling",
      "title": "Error Handling and Edge Cases",
      "summary": "Systematizes how the CDN should behave when components fail or receive unexpected input, ensuring robustness.",
      "subsections": [
        {
          "id": "failure-modes",
          "title": "Failure Modes & Recovery Strategies",
          "summary": "Catalogues failures (origin down, edge node down, network partition) and the system's response (serve stale, failover, degrade)."
        },
        {
          "id": "edge-cases",
          "title": "HTTP Edge Cases",
          "summary": "Handling of challenging HTTP scenarios like Vary: *, large file range requests, and malformed Cache-Control headers."
        }
      ]
    },
    {
      "id": "testing-strategy",
      "title": "Testing Strategy",
      "summary": "Provides a blueprint for verifying the CDN works correctly, including unit, integration, and milestone checkpoint tests.",
      "subsections": [
        {
          "id": "test-approaches",
          "title": "Testing Approaches & Properties",
          "summary": "Recommends property-based tests for cache correctness, integration tests for multi-node behavior, and load tests."
        },
        {
          "id": "milestone-checkpoints",
          "title": "Milestone Checkpoints",
          "summary": "For each of the 5 milestones, lists specific commands to run and expected outputs to verify correct implementation."
        }
      ]
    },
    {
      "id": "debugging-guide",
      "title": "Debugging Guide",
      "summary": "A practical manual for diagnosing and fixing common issues learners will encounter while building the CDN.",
      "subsections": [
        {
          "id": "symptom-table",
          "title": "Symptom → Cause → Fix Table",
          "summary": "Table listing common symptoms (e.g., 'Origin gets duplicate requests'), their likely causes, and how to fix them."
        },
        {
          "id": "debugging-techniques",
          "title": "CDN-Specific Debugging Techniques",
          "summary": "Advice on adding debug headers, inspecting cache state, and simulating geo-distribution locally."
        }
      ]
    },
    {
      "id": "future-extensions",
      "title": "Future Extensions",
      "summary": "Explores natural enhancements to the foundational CDN, showing how the current design accommodates future growth.",
      "subsections": [
        {
          "id": "extensions-list",
          "title": "Potential Enhancements",
          "summary": "Ideas for advanced features like prefetching, image optimization, WebSocket proxying, and integrating with object storage."
        }
      ]
    },
    {
      "id": "glossary",
      "title": "Glossary",
      "summary": "Definitions of key terms, acronyms, and domain-specific vocabulary used throughout the document.",
      "subsections": [
        {
          "id": "terms",
          "title": "Term Definitions",
          "summary": "Alphabetical list of terms from 'Anycast' to 'Vary Header' with clear, concise definitions."
        }
      ]
    }
  ],
  "diagrams": [
    {
      "id": "sys-component",
      "title": "High-Level System Component Diagram",
      "description": "Shows all major components (Client, Edge Nodes, Origin Shield, Origin, Control Plane) and their network relationships. Illustrates the flow of user requests (solid lines) and control messages (dashed lines).",
      "type": "component",
      "relevant_sections": [
        "high-level-arch",
        "interactions-data-flow"
      ]
    },
    {
      "id": "data-model-class",
      "title": "Data Model: Cache Entry & Relationships",
      "description": "Class diagram showing the CacheEntry data structure with its fields (key, headers, body, expires_at, tags). Links to supporting structures like SurrogateKeyIndex and BanRule.",
      "type": "class",
      "relevant_sections": [
        "data-model"
      ]
    },
    {
      "id": "state-machine-cache-entry",
      "title": "State Machine: Cache Entry Lifecycle",
      "description": "Shows the states of a cache entry: MISS, FRESH, STALE, REVALIDATING, and the events that trigger transitions (e.g., TTL expiry, purge request, successful revalidation).",
      "type": "state-machine",
      "relevant_sections": [
        "component-edge-cache"
      ]
    },
    {
      "id": "seq-cache-miss-shield",
      "title": "Sequence: Cache Miss with Origin Shielding",
      "description": "Sequence diagram tracing a user request from Client -> Edge (miss) -> Shield (collapses concurrent requests) -> Origin -> back through the chain to the client. Includes waiting concurrent requests at the shield.",
      "type": "sequence",
      "relevant_sections": [
        "component-origin-shield",
        "interactions-data-flow"
      ]
    },
    {
      "id": "flowchart-request-handling",
      "title": "Flowchart: Edge Node Request Handling",
      "description": "Detailed flowchart of the logic inside an Edge Node's HTTP handler. Steps include: parse request, generate cache key, check cache, validate (304 logic), on miss fetch from shield/origin, store, apply compression, and finally respond.",
      "type": "flowchart",
      "relevant_sections": [
        "component-edge-cache"
      ]
    },
    {
      "id": "diagram-consistent-hashing-ring",
      "title": "Consistent Hashing Ring for Edge Distribution",
      "description": "Visualization of a consistent hashing ring. Shows edge nodes (e.g., Edge-US, Edge-EU) and cache keys (e.g., hash('/image.jpg')) placed on the ring, with arrows pointing from keys to the next edge node clockwise.",
      "type": "component",
      "relevant_sections": [
        "component-edge-distribution"
      ]
    },
    {
      "id": "seq-invalidation-propagation",
      "title": "Sequence: Purge Propagation via Control Plane",
      "description": "Sequence diagram showing an Admin issuing a purge command to the Control Plane, which then broadcasts the invalidation message to all registered Edge Nodes, which then delete their local cache entries.",
      "type": "sequence",
      "relevant_sections": [
        "component-cache-invalidation",
        "interactions-data-flow"
      ]
    }
  ]
}