{
  "title": "AES-From-Scratch: Design Document",
  "overview": "This document guides the implementation of the Advanced Encryption Standard (AES) block cipher from scratch, focusing on understanding symmetric cryptography fundamentals. The key architectural challenge is structuring the complex, interdependent mathematical operations (Galois Field arithmetic, S-boxes, and the key schedule) into a clear, modular, and testable codebase that correctly implements the AES specification (FIPS 197) and multiple modes of operation.",
  "sections": [
    {
      "id": "context",
      "title": "1. Context and Problem Statement",
      "summary": "Explores the need for symmetric encryption, introduces the AES standard, and frames the challenge of implementing a mathematically complex cipher in clean software.",
      "subsections": [
        {
          "id": "analogy",
          "title": "Mental Model: The Digital Combination Lock",
          "summary": "Explains AES as a sophisticated, multi-step lock for digital data, using an analogy of scrambling and mixing a grid of bytes."
        },
        {
          "id": "problem-details",
          "title": "The Problem: Building a Reliable Block Cipher",
          "summary": "Describes the technical challenge of accurately implementing the series of reversible transformations that provide confusion and diffusion."
        },
        {
          "id": "existing-approaches",
          "title": "Existing Approaches and Comparisons",
          "summary": "Compares implementing from spec versus using libraries, and table-based versus on-the-fly computation."
        }
      ]
    },
    {
      "id": "goals",
      "title": "2. Goals and Non-Goals",
      "summary": "Defines the scope of the educational implementation, clarifying what must be built and what is explicitly out of scope.",
      "subsections": [
        {
          "id": "must-haves",
          "title": "Must-Have Goals",
          "summary": "Lists core functional requirements: AES-128/192/256, ECB/CBC/CTR modes, and correct handling of padding."
        },
        {
          "id": "non-goals",
          "title": "Explicit Non-Goals",
          "summary": "Specifies what this implementation is not: production-grade, side-channel resistant, or a general-purpose crypto library."
        }
      ]
    },
    {
      "id": "high-level-arch",
      "title": "3. High-Level Architecture",
      "summary": "Presents the top-level component decomposition and the recommended file/module structure for the codebase.",
      "subsections": [
        {
          "id": "component-overview",
          "title": "Component Overview and Responsibilities",
          "summary": "Describes the four main logical components: Galois Field Math, AES Core, Key Schedule, and Cipher Modes."
        },
        {
          "id": "file-structure",
          "title": "Recommended File Structure",
          "summary": "Provides a skeleton directory and file layout to organize the project logically, separating concerns."
        }
      ]
    },
    {
      "id": "data-model",
      "title": "4. Data Model",
      "summary": "Defines the core data structures used throughout the system, focusing on the state matrix and key schedule.",
      "subsections": [
        {
          "id": "core-types",
          "title": "Core Types and Structures",
          "summary": "Tables describing the State matrix, Round Key, and S-box lookup table types."
        },
        {
          "id": "relationships",
          "title": "Type Relationships",
          "summary": "Describes how the core types flow through the encryption process."
        }
      ]
    },
    {
      "id": "galois-field",
      "title": "5. Component Design: Galois Field Arithmetic",
      "summary": "Details the implementation of finite field GF(2^8) operations, which underpin all AES math. Corresponds to Milestone 1.",
      "subsections": [
        {
          "id": "gf-mental-model",
          "title": "Mental Model: Clock Arithmetic for Bytes",
          "summary": "Intuitively explains finite fields using the analogy of numbers wrapping around after a specific prime polynomial."
        },
        {
          "id": "gf-interface",
          "title": "Interface Specification",
          "summary": "Lists the required functions: addition (XOR), multiplication, inverse, S-box generation."
        },
        {
          "id": "gf-behavior",
          "title": "Internal Behavior and Algorithms",
          "summary": "Step-by-step description of multiplication via xtime and S-box construction."
        },
        {
          "id": "gf-adr",
          "title": "Architecture Decision Record: Precomputed Tables vs. On-the-Fly",
          "summary": "Analyzes the trade-off between speed (lookup tables) and clarity/space (direct computation) for S-boxes and multiplication."
        },
        {
          "id": "gf-pitfalls",
          "title": "Common Pitfalls",
          "summary": "Lists typical errors like using the wrong irreducible polynomial or incorrect byte ordering in tables."
        },
        {
          "id": "gf-impl-guide",
          "title": "Implementation Guidance",
          "summary": "Provides skeleton code for GF(2^8) operations and S-box generation, with TODOs for core logic."
        }
      ]
    },
    {
      "id": "aes-core",
      "title": "6. Component Design: AES Core Operations",
      "summary": "Covers the four round transformations (SubBytes, ShiftRows, MixColumns, AddRoundKey). Corresponds to Milestone 2.",
      "subsections": [
        {
          "id": "core-mental-model",
          "title": "Mental Model: The Mixing Pipeline",
          "summary": "Describes the round operations as a series of shuffling, substituting, and mixing steps on a 4x4 grid."
        },
        {
          "id": "core-interface",
          "title": "Interface Specification",
          "summary": "Tables for each transformation function, their inputs (state, round key), and outputs."
        },
        {
          "id": "core-behavior",
          "title": "Internal Behavior per Transformation",
          "summary": "Algorithm steps for each of the four operations, including ShiftRows direction and MixColumns matrix multiplication."
        },
        {
          "id": "core-adr",
          "title": "Architecture Decision Record: State Representation",
          "summary": "Evaluates options for representing the state matrix (1D array vs. 2D array) and their impact on code clarity for row/column operations."
        },
        {
          "id": "core-pitfalls",
          "title": "Common Pitfalls",
          "summary": "Highlights mistakes like incorrect row shift direction, mixing up row-major/column-major order, and misapplying MixColumns coefficients."
        },
        {
          "id": "core-impl-guide",
          "title": "Implementation Guidance",
          "summary": "Skeleton code for the round transformations, using the chosen state representation."
        }
      ]
    },
    {
      "id": "key-expansion",
      "title": "7. Component Design: Key Expansion",
      "summary": "Details the key schedule algorithm that derives round keys from the cipher key. Corresponds to Milestone 3.",
      "subsections": [
        {
          "id": "ke-mental-model",
          "title": "Mental Model: The Key Stretcher",
          "summary": "Analogy of stretching a short key into a longer sequence of derived keys, using a predictable but non-linear process."
        },
        {
          "id": "ke-interface",
          "title": "Interface Specification",
          "summary": "Function signature for expanding a key into an array of round keys for AES-128/192/256."
        },
        {
          "id": "ke-behavior",
          "title": "Internal Behavior and Algorithm",
          "summary": "Step-by-step pseudocode for the key schedule, covering RotWord, SubWord, and Rcon application."
        },
        {
          "id": "ke-adr",
          "title": "Architecture Decision Record: Key Schedule Storage",
          "summary": "Compares storing all round keys precomputed vs. generating them on-demand for each round, considering memory vs. computation."
        },
        {
          "id": "ke-pitfalls",
          "title": "Common Pitfalls",
          "summary": "Identifies errors like incorrect Rcon index, wrong key size handling, and endianness issues in word operations."
        },
        {
          "id": "ke-impl-guide",
          "title": "Implementation Guidance",
          "summary": "Skeleton code for the key expansion routine, with TODOs for handling different AES key sizes."
        }
      ]
    },
    {
      "id": "encryption-modes",
      "title": "8. Component Design: Encryption and Modes of Operation",
      "summary": "Covers the complete AES block cipher and its chaining modes (ECB, CBC, CTR). Corresponds to Milestone 4.",
      "subsections": [
        {
          "id": "mode-mental-model",
          "title": "Mental Model: Block Ciphers and Chaining",
          "summary": "Explains ECB as independent blocks, CBC as interlinked chains, and CTR as a streaming keystream generator."
        },
        {
          "id": "mode-interface",
          "title": "Interface Specification",
          "summary": "Function tables for encrypt/decrypt for each mode, including parameters like IV and padding scheme."
        },
        {
          "id": "mode-behavior",
          "title": "Internal Behavior per Mode",
          "summary": "Algorithm steps for full AES encryption (with rounds), and the data flow for CBC and CTR modes."
        },
        {
          "id": "mode-adr",
          "title": "Architecture Decision Record: Padding Strategy",
          "summary": "Evaluates PKCS#7 vs. other padding methods (like zero-padding) for simplicity and security."
        },
        {
          "id": "mode-pitfalls",
          "title": "Common Pitfalls",
          "summary": "Warns about ECB's insecurity for patterned data, IV reuse in CBC, and counter management in CTR."
        },
        {
          "id": "mode-impl-guide",
          "title": "Implementation Guidance",
          "summary": "Skeleton code for the main encryption/decryption loops and mode implementations, including PKCS#7 padding helpers."
        }
      ]
    },
    {
      "id": "interactions",
      "title": "9. Interactions and Data Flow",
      "summary": "Illustrates how components interact during a typical encryption request, from plaintext to ciphertext.",
      "subsections": [
        {
          "id": "sequence-encryption",
          "title": "Sequence of Operations for CBC Encryption",
          "summary": "Step-by-step walkthrough of data flow: padding -> IV XOR -> AES block cipher -> chaining."
        },
        {
          "id": "message-formats",
          "title": "Message and Data Formats",
          "summary": "Describes the expected input/output formats for keys, IVs, plaintext, and ciphertext."
        }
      ]
    },
    {
      "id": "error-handling",
      "title": "10. Error Handling and Edge Cases",
      "summary": "Defines the failure modes and how the implementation should handle invalid inputs and edge conditions.",
      "subsections": [
        {
          "id": "failure-modes",
          "title": "Failure Modes and Detection",
          "summary": "Lists errors like invalid key length, non-multiple block size (for ECB/CBC without padding), and invalid padding on decryption."
        },
        {
          "id": "recovery-strategy",
          "title": "Recovery Strategies",
          "summary": "Specifies whether to fail fast with clear errors or attempt recovery for educational purposes."
        }
      ]
    },
    {
      "id": "testing",
      "title": "11. Testing Strategy",
      "summary": "Outlines a verification plan using known-answer tests and incremental milestone checkpoints.",
      "subsections": [
        {
          "id": "verification-properties",
          "title": "Properties to Verify",
          "summary": "Describes what correctness means: matching NIST test vectors, reversibility (decrypt(encrypt(x)) == x)."
        },
        {
          "id": "milestone-checkpoints",
          "title": "Milestone Checkpoints",
          "summary": "For each milestone, specifies the expected behavior, test commands, and sample outputs to confirm progress."
        }
      ]
    },
    {
      "id": "debugging",
      "title": "12. Debugging Guide",
      "summary": "Provides a symptom-cause-fix table for common implementation bugs and techniques for inspecting state.",
      "subsections": [
        {
          "id": "symptom-table",
          "title": "Common Bug Symptoms and Fixes",
          "summary": "Table mapping symptoms (e.g., 'First test vector fails') to likely causes (e.g., 'S-box off by one') and fixes."
        },
        {
          "id": "debug-techniques",
          "title": "Debugging Techniques for AES",
          "summary": "Suggests approaches like printing the state matrix after each round or comparing intermediate values with reference implementations."
        }
      ]
    },
    {
      "id": "future-extensions",
      "title": "13. Future Extensions",
      "summary": "Suggests potential enhancements to the project for further learning.",
      "subsections": [
        {
          "id": "extensions-list",
          "title": "Possible Enhancements",
          "summary": "Ideas like adding more modes (GCM), implementing decryption, optimizing with SSE/AVX, or adding a simple CLI."
        }
      ]
    },
    {
      "id": "glossary",
      "title": "14. Glossary",
      "summary": "Defines key technical terms, acronyms, and domain-specific vocabulary used in this document.",
      "subsections": [
        {
          "id": "terms-table",
          "title": "Terminology Reference",
          "summary": "Alphabetical list of terms (AES, Block Cipher, IV, S-box, etc.) with clear definitions and references."
        }
      ]
    }
  ],
  "diagrams": [
    {
      "id": "sys-comp",
      "title": "High-Level System Component Diagram",
      "description": "Shows the four main components (GF Math, AES Core, Key Expansion, Cipher Modes) and their dependencies. Include data flows for key and plaintext.",
      "type": "component",
      "relevant_sections": [
        "high-level-arch",
        "interactions"
      ]
    },
    {
      "id": "data-model-diag",
      "title": "Data Model: State Matrix and Key Schedule",
      "description": "Visual representation of the 4x4 State matrix (bytes) and the expanded key schedule (array of words). Show the relationship between the state and a round key during AddRoundKey.",
      "type": "class",
      "relevant_sections": [
        "data-model",
        "aes-core",
        "key-expansion"
      ]
    },
    {
      "id": "seq-encrypt",
      "title": "Sequence Diagram: CBC Encryption",
      "description": "Illustrates the step-by-step interaction between the user, padding logic, CBC mode, and the AES core block cipher for encrypting a multi-block message. Include the IV and chaining feedback.",
      "type": "sequence",
      "relevant_sections": [
        "interactions",
        "encryption-modes"
      ]
    },
    {
      "id": "flow-key-expand",
      "title": "Flowchart: Key Expansion for AES-128",
      "description": "A flowchart detailing the algorithm for expanding a 16-byte key into 44 words (11 round keys). Include decision points for the key size and the special treatment every 4th word.",
      "type": "flowchart",
      "relevant_sections": [
        "key-expansion"
      ]
    },
    {
      "id": "flow-aes-round",
      "title": "Flowchart: A Single AES Encryption Round",
      "description": "Shows the order of operations within a round (SubBytes, ShiftRows, MixColumns, AddRoundKey) and the different initial/final round structure.",
      "type": "flowchart",
      "relevant_sections": [
        "aes-core",
        "encryption-modes"
      ]
    },
    {
      "id": "state-cbc",
      "title": "State Machine: CBC Mode Operation",
      "description": "Depicts the states of the CBC encryptor/decryptor: idle, processing block, waiting for next block, final (padding). Include transitions for data input and finalization.",
      "type": "state-machine",
      "relevant_sections": [
        "encryption-modes"
      ]
    }
  ]
}